Description: Configures Firefox for Gorilla
Identifier: com.github.arequ.gorilla.Firefox-Win64
MinimumVersion: '1.0.0'

Input:
  SHORTNAME: Firefox
  GORILLA_REPO: /Users/Shared/gorilla_repo
  GORILLA_CATALOG: alpha
  GORILLA_SUBDIRECTORIES: firefox/

ParentRecipe: com.github.arequ.download.Firefox-Win64

Process:
- Processor: com.github.arequ.SharedProcessors/GorillaImporter
  Arguments:
    gorilla_repo: '%GORILLA_REPO%'
    gorilla_catalog: '%GORILLA_CATALOG%'
    gorilla_subdirectories: '%GORILLA_SUBDIRECTORIES%'
    pkg_shortname: '%SHORTNAME%'
    pkg_version: '%pkg_version%'
