Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Rectangle and creates a package.
Identifier: com.github.arequ.pkg.Rectangle

Input:
  NAME: Rectangle
MinimumVersion: '1.0.0'

ParentRecipe: com.github.arequ.download.Rectangle

Process:
- Processor: AppPkgCreator
