Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Rectangle and imports it into Munki.
Identifier: com.github.arequ.munki.Rectangle

Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: Rectangle
  pkginfo:
    catalogs:
    - testing
    description: Move and resize windows on macOS with keyboard shortcuts and snap
      areas
    developer: Ryan Hanson
    display_name: Rectangle
    name: '%NAME%'
    unattended_install: true

MinimumVersion: '1.0.0'

ParentRecipe: com.github.arequ.download.Rectangle

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
