Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Installs the latest version of Rectangle.
Identifier: com.github.arequ.install.Rectangle

Input:
  NAME: Rectangle

MinimumVersion: '1.0.0'
ParentRecipe: com.github.arequ.download.Rectangle

Process:
- Processor: InstallFromDMG
  Arguments:
    dmg_path: '%pathname%'
    items_to_copy:
    - destination_path: /Applications
      source_item: Rectangle.app
  
