Description: Downloads the latest version of Rectangle and creates a package.
Identifier: com.github.arequ.pkg.Rectangle
MinimumVersion: '1.0.0'

Input:
  NAME: Rectangle

ParentRecipe: com.github.arequ.download.Rectangle

Process:
- Processor: AppPkgCreator
