Description: Downloads the latest version of Rectangle and imports it into Munki.
Identifier: com.github.arequ.munki.Rectangle
MinimumVersion: '1.0.0'

Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: Rectangle
  pkginfo:
    catalogs:
    - testing
    description: Move and resize windows on macOS with keyboard shortcuts and snap
      areas
    developer: Ryan Hanson
    display_name: Rectangle
    name: '%NAME%'
    unattended_install: true

ParentRecipe: com.github.arequ.download.Rectangle

Process:
- Processor: MunkiImporter
  Arguments:
    extract_icon: true
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
