Description: Import Doppler CLI pkg into Munki.
Identifier: com.github.arequ.munki.DopplerCLI
MinimumVersion: '2.0'

Input:
  MUNKI_CATEGORY: Developer
  MUNKI_DEVELOPER: Doppler
  MUNKI_REPO_SUBDIR: applications/Doppler/DopplerCLI
  NAME: DopplerCLI
  pkginfo:
    blocking_applications:
    - doppler
    catalogs:
    - alpha
    category: '%MUNKI_CATEGORY%'
    description: The Doppler CLI for managing secrets and config.
    developer: '%MUNKI_DEVELOPER%'
    display_name: Doppler CLI
    name: '%NAME%'
    supported_architectures:
    - arm64
    unattended_install: true

ParentRecipe: com.github.arequ.pkg.DopplerCLI

Process:
- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      version: '%version%'

- Processor: MunkiImporter
  Arguments:
    extract_icon: true
    pkg_path: '%pkg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
