Description: >
  Install Doppler CLI as a flat package (default /usr/local/bin/doppler).
  Override INSTALL_BINDIR_RELATIVE and BINARY_FILENAME to change the install
  directory and binary name. When you change INSTALL_BINDIR_RELATIVE, replace
  PkgRootCreator Arguments pkgdirs with a single mapping from that same path
  (relative to the volume root, no leading slash) to its mode, e.g.
  opt/corporation/bin: '0755'.
Identifier: com.github.arequ.pkg.DopplerCLI
MinimumVersion: '2.0'

Input:
  BUNDLE_ID: com.dopplerhq.cli
  BINARY_FILENAME: doppler
  INSTALL_BINDIR_RELATIVE: usr/local/bin
  NAME: DopplerCLI
  PKG_DIR_MODE: '0755'

ParentRecipe: com.github.arequ.download.DopplerCLI

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      usr/local/bin: '%PKG_DIR_MODE%'
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/%INSTALL_BINDIR_RELATIVE%/%BINARY_FILENAME%'
    overwrite: true
    source_path: '%RECIPE_CACHE_DIR%/%NAME%/doppler'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: wheel
        mode: '0755'
        path: '%INSTALL_BINDIR_RELATIVE%/%BINARY_FILENAME%'
        user: root
      id: '%BUNDLE_ID%'
      options:
        purge_ds_store: true
      pkgname: '%NAME%-%version%'
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgtype: flat
      version: '%version%'
