Description: Installs the latest version of Python.
Identifier: com.github.arequ.install.Python
MinimumVersion: '1.0.0'

Input:
  NAME: Python

ParentRecipe: com.github.arequ.download.Python

Process:
- Processor: Installer
  Arguments:
    pkg_path: '%pathname%'
    
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/Python3.framework/Versions/3.9/Resources/Python.app'
    requirement: identifier "org.python.python" and anchor apple generic and certificate
      1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13]
      /* exists */ and certificate leaf[subject.OU] = "9GQZ7KUFR6"
