Description: Downloads the latest version of Python.
Identifier: com.github.arequ.download.Python
MinimumVersion: '1.0.0'

Input:
  NAME: Python

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: .*\.pkg$
    github_repo: macadmins/python

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.pkg'

- Processor: EndOfCheckPhase

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/%NAME%/Python3.framework/Versions/3.9/Resources/Python.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
