Description: Downloads the latest version of Python.
Identifier: com.github.arequ.download.Python
MinimumVersion: '1.0.0'

Input:
  NAME: Python

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: .*\.pkg$
    github_repo: macadmins/python

- Processor: URLDownloaderPython
  Arguments:
    filename: '%NAME%-%version%.pkg'

- Processor: EndOfCheckPhase
