Description: Downloads the latest version of Google Chrome Enterprise (64-bit) for Windows
Identifier: com.github.arequ.download.Nessus-Win64
MinimumVersion: '1.0.0'

Input:
  SIGNATURE: E59B5250A978903656E8EFDB422C10E65AB85A99DC4F230A69E97D8F1301D1BA
  SUBJECT: /C=US/ST=California/L=Mountain View/O=Google LLC/CN=Google LLC
  BASE_URL: https://www.tenable.com/downloads/api/v1/public/pages/nessus-agents/downloads

Process:
- Processor: URLTextSearcher
  Arguments:
    url: https://www.tenable.com/downloads/nessus-agents
    result_output_var_name: latest_version
    re_pattern: \"file-name\"\>NessusAgent-(.*)-x64.msi

- Processor: URLTextSearcher
  Arguments:
    url: https://www.tenable.com/downloads/nessus-agents
    result_output_var_name: download_id
    re_pattern: \"id\":(\d*),\"file\":"NessusAgent-[\d\.]*-x64.msi

- Processor: URLDownloader
  Arguments:
    url: '%BASE_URL%/%download_id%/download?i_agree_to_tenable_license_agreement=true'
    prefetch_filename: true
    request_headers:
      user-agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2227.1 Safari/537.36
    CHECK_FILESIZE_ONLY: true

- Processor: EndOfCheckPhase

- Processor: com.github.arequ.SharedProcessors/WinSignatureVerify
  Arguments:
    pathname: '%pathname%'
    expected_subject: '%SUBJECT%'
    expected_signature: '%SIGNATURE%'

- Processor: com.github.arequ.SharedProcessors/WinVersioner
  Arguments:
    pathname: '%pathname%'
