Description: Configures Chrome specifically for Uber implementation..
Identifier: com.github.arequ.gorilla.Nessus-Win64
MinimumVersion: '1.0.0'

Input:
  SHORTNAME: nessus
  GORILLA_REPO: /Users/alex.alequin/src/gorilla_repo_local
  GORILLA_CATALOG: alpha
  GORILLA_SUBDIRECTORIES: nessus/
  yaml_entry:
    installer:
      arguments:
        - /qn
        - /norestart
    check:
      registry:
        version: ''
        name: ''
    uninstaller:
      location: ''
      hash: ''
      type: ''

ParentRecipe: com.github.arequ.download.Nessus-Win64

Process:
- Processor: com.github.arequ.SharedProcessors/GorillaImporter
  Arguments:
    gorilla_repo: '%GORILLA_REPO%'
    gorilla_catalog: '%GORILLA_CATALOG%'
    gorilla_subdirectories: '%GORILLA_SUBDIRECTORIES%'
    pkg_shortname: '%SHORTNAME%'
    pkg_version: '%pkg_version%'
