Description: Configures Chrome specifically for Uber implementation..
Identifier: com.github.arequ.gorilla.Chrome-Enterprise-Win64
MinimumVersion: '1.0.0'

Input:
  NAME: Google Chrome
  SHORTNAME: GoogleChrome
  GORILLA_REPO: /Users/Shared/gorilla_repo
  GORILLA_CATALOG: alpha
  GORILLA_SUBDIRECTORIES: google/chrome

ParentRecipe: com.github.arequ.download.Chrome-Enterprise-Win64

Process:
- Processor: com.github.arequ.SharedProcessors/GorillaImporter
  Arguments:
    gorilla_repo: '%GORILLA_REPO%'
    gorilla_catalog: '%GORILLA_CATALOG%'
    gorilla_subdirectories: '%GORILLA_SUBDIRECTORIES%'
    pkg_shortname: '%SHORTNAME%'
    pkg_version: '%pkg_version%'
