Description: Installs the latest version of Salt.
Identifier: com.github.arequ.install.Salt
MinimumVersion: '1.0.0'

Input:
  NAME: Salt

ParentRecipe: com.github.arequ.download.Salt

Process:
- Processor: Installer
  Arguments:
    pkg_path: '%pathname%'
  