Description: Downloads the latest version of Stats.
Identifier: com.github.arequ.download.Stats
MinimumVersion: '1.0.0'

Input:
  NAME: Stats

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: .*\.dmg$
    github_repo: exelban/stats

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.dmg'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Stats.app'
    requirement: anchor apple generic and identifier "eu.exelban.Stats" and (certificate
      leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6]
      /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists
      */ and certificate leaf[subject.OU] = RP2S87B72W)

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Stats.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
