Description: Downloads the latest version of iTerm2.
Identifier: com.github.arequ.download.iTerm2
MinimumVersion: '1.0.0'

Input:
  APP_FILENAME: iTerm
  NAME: iTerm2

Process:
- Processor: SparkleUpdateInfoProvider
  Arguments:
    appcast_url: https://iterm2.com/appcasts/final_modern.xml

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.zip'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: 'download_changed == FALSE'

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/iTerm.app'
    requirement: anchor apple generic and identifier "com.googlecode.iterm2" and (certificate
      leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6]
      /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists
      */ and certificate leaf[subject.OU] = H7V7XYVQ7D)
