Description: Downloads the latest version of iTerm2 and creates a package.
Identifier: com.github.arequ.pkg.iTerm2
MinimumVersion: '1.0.0'

Input:
  APP_FILENAME: iTerm
  NAME: iTerm2

ParentRecipe: com.github.arequ.download.iTerm2

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/%NAME%/iTerm.app'
