Description: Installs the latest version of SensibleSideButtons.
Identifier: com.github.arequ.install.SensibleSideButtons
MinimumVersion: '1.0.0'

Input:
  NAME: SensibleSideButtons

ParentRecipe: com.github.arequ.download.SensibleSideButtons

Process:
- Processor: InstallFromDMG
  Arguments:
    dmg_path: '%pathname%'
    items_to_copy:
    - destination_path: /Applications
      source_item: SensibleSideButtons.app
