Description: Downloads the latest version of SensibleSideButtons and imports it into
  Munki.
Identifier: com.github.arequ.munki.SensibleSideButtons
MinimumVersion: '1.0.0'

Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: SensibleSideButtons
  pkginfo:
    catalogs:
    - testing
    description: A macOS menu bar app that enables system-wide navigation functionality
      for the side buttons on third-party mice.
    developer: Alexei Baboulevitch
    display_name: SensibleSideButtons
    name: '%NAME%'
    unattended_install: true

ParentRecipe: com.github.arequ.download.SensibleSideButtons

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
