Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)

Description: Downloads the latest version of SensibleSideButtons.

Identifier: com.github.arequ.download.SensibleSideButtons

Input:
  NAME: SensibleSideButtons

MinimumVersion: '1.0.0'

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    github_repo: archagon/sensible-side-buttons
  

- Processor: URLDownloader
  Arguments:
      filename: '%NAME%-%version%.dmg'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/SensibleSideButtons.app'
    requirement: anchor apple generic and identifier "net.archagon.sensible-side-buttons"
      and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate
      1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13]
      /* exists */ and certificate leaf[subject.OU] = R4MX2B96J2)
  

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/SensibleSideButtons.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
  
